#კლინიკის მენეჯმენტის სოფტი
main_manu = {
        "1": "Registracion desk: ", # 
        "2": "Management: ",
        "3": "Accounting : "
}
MENU_registration_desk = {
        "1": "Register new Patient", #პაციენტის რეგისტრაციია. უნდა შეგვაყვანინოს სახელი, გვარი, პირადი ნომერი, დაბადების წელი, ტელეფონის ნომერი, აგნერირებს უნიკალურ აიდის, შეინახოს ინფორმაცია ფაილში. 
        "2": "Open medical history", #იკითხოს რეგისტრირებულია თუ არა პაციენტი, თუ კი მოითხოვოს პირადი ნომერი და შემდეგ შეიყვანოს ანამნეზის მონაცემები. 
                                     #თუ არა გაიაროს რეგისტრაციის პროცესი და შემდეგ ანამნეზის მონაცემბები (ინფორმაცია შეინახოს სამედიცინო ისტორიის ფაილში)
        "3": "Transfer patient to doctor",# გადაამისამართოს პაციენტი ექიმთან, პაციენტის მონაცემებს უნდა გაყვეს სამედიცინო ისტორია. 
                                      # ექიმის ქვე მენიუ - დაამატოს პაციენტის ისტორიას დანიშნულება. ეს ინფორმაცია ავტომატურად უნდა აისახის სამედიცინო ისტორიაში.
        "4": "Reaserch Service",  #შეგვყავს პაციენტის პირადი ნომერი ან UID, გამოდის ქვე მენიუ სადაც ვირჩევთ თუ რა კვლევა უნდა ჩაუტარდეს პაციენტს, 
                           #პროგრამა გვეკითხება დავამატოთ თუ არა ერთის გარდა კიდევ სხვა კვლევა. შემდეგ იღებს მონაცემებს წინასწარ გამზადებული ბაზიდან. ანგარიშობს გადასახდელ თანხას 
                           #და ბეჭდავს ინფორმაციას. ამატებს პაციენტის ისტორიას კვლევების შესახებ მონაცემებს.
        "5": "View full medical history", #პირადი ნომრით ეძებს პაციენტის სამედიცინო ისტორიას და ბეჭდავს სრულ მონაცემებს.
        "6": "View only researches", #პირადი ნომრით ეძებს მხოლოდ ინფორმაციას კველების შესახებ და ბეჭდავს.
        "7": "Register appointment : ", # პაციენტს ჩაწერს ექიმთან, სმს-ის სახით გაუგზავნის ინფორმაციას პაციენტს
        
        "8": "Exit"
        }
    #პაციენტის რეგისტრაციის დროს მოწმდება პირადი ნომერი არის თუ არა ბაზაში. ასევე პაციენტის მონაცემების ნებისმიერი გამოძახების დროს
    #შეყვანილი ინფორმაცია შეესაბამება თუ არა განსაზღვრულ ფორმატს. მაგ. სახელი და გვარი მხოლოდ სტრინგი უნდა იყოს და აშ. ვალიდაცია ხდება ყოველთვის როცა შეგცყავს მონაცემები


#ექიმის სატესტო მენიუ უფრო დიდი შეიძლება იყოს ეხლა მხოლოდ დანიშნულების ნაწილია
SUB_menu_doctor = {
        "1": "Add prescription:", # ექიმი ამ მენიუთი ამატებს დანიშნულებას. რაც ავტომატურად ემატება ავადმყოფობის ისტორიას
        "2": "Exit"
         }
    

#კვლევების მენიუ ესეც გაცილებით დიდი იქნება ყველა კვლევა რომ ჩაისვას 
SUB_menu_researches = {
        "1": "Blood analysis", # ავტომატურად ემატება ისტორიას
        "2": "ultrasound",  # ავტომატურად ემატება ისტორიას
        "3": "X-ray",  # ავტომატურად ემატება ისტორიას
        "4": "Alergy test",# ავტომატურად ემატება ისტორიას
        "5": "Exit"
         }

#მენეგერის მენიუ სტაფის სამართავად
MENU_clinic_mangment = {
        "1": "View full List of Staff: ", # ანახებს პერსონალის სრულ სიას
        "2": "View List of support staff on duty: ", #აჩვენებს მხოლოდ დამხმარე პერსონალის სიას
        "3": "View List of doctors on duty: ",  #აჩვენებს მხოლოდ მორიგი ექიმების სიას
        "4": "View List of nuerses on duty: ", #აჩვენებს მხოლოდ ექთნების სიას
        "5": "Create task and asigne personal to it: ", #აკეთებს დავალებას და აძლევს მას შერჩეულ პერსონალს
        "6": "Add new staff memeber: ", #ამატებს ახალ თანამშრომელს
        "7": "Remove staff memeber: ", #შლის გათავისუფლებულ თანამშრომელს
        "8": "Exit"
         }

#დავალებების შექმის ან წაშლის ქვე მენიუ
SUB_menu_tasks = {
        "1": "Create task: ", # 
        "2": "Remove task: ",
        "3": "View all tasks: ",
        "4": "View task al staff member: "
        }
#ბუღალტერის პატარა მენიუ სატესტოდ
MENU_clinic_accounting = {
        "1": "Calculate cost of the procedure: ", # ბუღლატერს გამოუვა მენიუ სადაც ირჩევს იმ პროცედურებს რომელიც უნდა ჩაუტარდეს პაციენტს
                                                 # ირჩევს შესაბამის პროცედურებს პროგრამას გამოყავს მთლიანი ღრებულება
        "2": "Calculate salary for staff member: ", # შეყავს თანამშრომლის პირადი ნომერი, ასევე შეყავს ის მომსახურება რაც თანამშრომელმა განახორციელა. 
                                            # ანგარიშობს ამ პროცედურებისთვის დადგენილ ასანაზღაურებელ პროცენტს ამატებს ფიქსირებულ ხელფასს. 
                                            # ანგარიშობს გადასახდელ ხელფასს
        "3": "View services that hospital is providing: ",  #ნახულობს კლინკის მომსახურებების მთლიან სიას გაწერილი ფასებით
        "4": "View last monthes income: ", #ნახულობს ბოლო თვის შემოსავლებს. 
        
        "6": "Exit"
         }